<a href="https://colab.research.google.com/github/maah-gabs/Python_do_zero/blob/master/Lidando_com_dados_duplicados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Módulo 04: Aula 11 - Lidando com dados ausentes. 

Valores duplicados em uma análise podem prejudicar uma análise causando prejuizos e promover a desinformação. 

Mais uma vez nas nossas análises, vamos usar o Pandas.

In [1]:
# Importar as bibliotecas 
import pandas as pd

In [3]:
df = pd.read_excel('https://www.dropbox.com/s/v0x8mbaygdqubli/contas_a_pagar.xlsx?dl=1')
df

   pagamento    valor  codigo_pagamento
0  imposto x   458.86      123456789012
1  imposto y   467.69      123456789012
2  imposto z    25.15      555444332221
3       agua   951.31      568754456745
4        luz  1548.25      546982454523
5   internet   798.99      364821542215
6  segurança  1439.54      546982454123
7  segurança  1439.54      546982454123
8        luz   147.45      546982454523

Para identificar entradas duplicadas vamos usar o método `duplicated` do Pandas.

Por padrão, ele retorna a primeira entrada como False, e a primeira vez que ela é repetida como True.

Ao rodar no código inteiro, ele percebe que apenas duas entradas são exatamente iguais. Para nos dar um pouco mais de trabalho, esse conjunto de dados possui:

* Linhas completamente repetidas
* Códigos repetidos
* Nomes repetidos

Duas entradas 100% iguais como é o caso aqui, sempre será um problema. Mas nem sempre linhas com algum valor repetido serão problema. Por exemplo, duas compras feitas pelo mesmo cliente e registradas em uma planilha terão várias informações repetidas, mas são, efetivamente, duas transações diferentes.

In [4]:
# Verificando linhas duplicadas 
df.duplicated() # Funciona para linha 100% identica.

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
dtype: bool

In [5]:
# Verificando duplicatas no código de pagamento 
df.duplicated(subset='codigo_pagamento')

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7     True
8     True
dtype: bool

Na etapa anterior, a gente identifiou quais são as linhas duplicadas, agora, a opção é excluir essas linhas utilizado o método `drop_duplicates ( )`, importante lembrar de utilizar o `inplace = True` para armazenar a mudança.

In [6]:
# Excluindo duplicadas - tenho 100% dos dados iguais 
df.drop_duplicates()

   pagamento    valor  codigo_pagamento
0  imposto x   458.86      123456789012
1  imposto y   467.69      123456789012
2  imposto z    25.15      555444332221
3       agua   951.31      568754456745
4        luz  1548.25      546982454523
5   internet   798.99      364821542215
6  segurança  1439.54      546982454123
8        luz   147.45      546982454523

Acima, excluimos apenas as linhas que estão exatamente iguais. Porém, estamos falando sobre formas de pagamentos.

In [7]:
# Excluindo os códigos duplicados 

df.drop_duplicates(subset = 'codigo_pagamento', inplace = True)

# Verificando o resultado 
df

   pagamento    valor  codigo_pagamento
0  imposto x   458.86      123456789012
2  imposto z    25.15      555444332221
3       agua   951.31      568754456745
4        luz  1548.25      546982454523
5   internet   798.99      364821542215
6  segurança  1439.54      546982454123

In [8]:
# Verificando as entradas únicas 

df['codigo_pagamento'].value_counts()

364821542215    1
555444332221    1
546982454523    1
568754456745    1
123456789012    1
546982454123    1
Name: codigo_pagamento, dtype: int64